       IDENTIFICATION DIVISION.
       PROGRAM-ID. DBUNLJGS.
       AUTHOR. 日本版CardDemo.
      ******************************************************************
      * GSAMアンロード(日本版)
      * GSAMアンロード(伝播)
      ******************************************************************
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-PROGRAM-ID  PIC X(8) VALUE 'DBUNLJGS'.
       PROCEDURE DIVISION.
       0000-主処理.
           DISPLAY 'GSAMアンロード'
           GOBACK.
